---
merged:
  before: []
  after:
    - name: Ansible Test
      disabled: false
      description: test description
      app: DA-ESS-EndpointProtection
      annotations:
        cis20:
          - test1
        mitre_attack:
          - test2
        kill_chain_phases:
          - test3
        nist:
          - test4
        custom:
          - framework: test_framework
            custom_annotations:
              - test5
      ui_dispatch_context: SplunkEnterpriseSecuritySuite
      time_earliest: -24h
      time_latest: now
      cron_schedule: "*/5 * * * *"
      scheduling: realtime
      schedule_window: "0"
      schedule_priority: default
      trigger_alert: once
      trigger_alert_when: number of events
      trigger_alert_when_condition: greater than
      trigger_alert_when_value: "10"
      throttle_window_duration: 5s
      throttle_fields_to_group_by:
        - test_field1
      suppress_alerts: False
      search: '| tstats summariesonly=true values("Authentication.tag") as "tag",dc("Authentication.user") as "user_count",dc("Authentication.dest") as "dest_count",count from datamodel="Authentication"."Authentication" where nodename="Authentication.Failed_Authentication" by "Authentication.app","Authentication.src" | rename "Authentication.app" as "app","Authentication.src" as "src" | where "count">=6'

replaced:
  before:
    - name: Ansible Test
      disabled: false
      description: test description
      app: DA-ESS-EndpointProtection
      annotations:
        cis20:
          - test1
        mitre_attack:
          - test2
        kill_chain_phases:
          - test3
        nist:
          - test4
        custom:
          - framework: test_framework
            custom_annotations:
              - test5
      ui_dispatch_context: SplunkEnterpriseSecuritySuite
      time_earliest: -24h
      time_latest: now
      cron_schedule: "*/5 * * * *"
      scheduling: realtime
      schedule_window: "0"
      schedule_priority: default
      trigger_alert: once
      trigger_alert_when: number of events
      trigger_alert_when_condition: greater than
      trigger_alert_when_value: "10"
      throttle_window_duration: 5s
      throttle_fields_to_group_by:
        - test_field1
      suppress_alerts: False
      search: '| tstats summariesonly=true values("Authentication.tag") as "tag",dc("Authentication.user") as "user_count",dc("Authentication.dest") as "dest_count",count from datamodel="Authentication"."Authentication" where nodename="Authentication.Failed_Authentication" by "Authentication.app","Authentication.src" | rename "Authentication.app" as "app","Authentication.src" as "src" | where "count">=6'

  after:
    - name: Ansible Test
      disabled: false
      description: test description
      app: SplunkEnterpriseSecuritySuite
      annotations:
        cis20:
          - test1
          - test2
        mitre_attack:
          - test3
          - test4
        kill_chain_phases:
          - test5
          - test6
        nist:
          - test7
          - test8
        custom:
          - framework: test_framework2
            custom_annotations:
              - test9
              - test10
      ui_dispatch_context: SplunkEnterpriseSecuritySuite
      time_earliest: -24h
      time_latest: now
      cron_schedule: "*/5 * * * *"
      scheduling: continuous
      schedule_window: auto
      schedule_priority: default
      trigger_alert: once
      trigger_alert_when: number of events
      trigger_alert_when_condition: greater than
      trigger_alert_when_value: "10"
      throttle_window_duration: 5s
      throttle_fields_to_group_by:
        - test_field1
        - test_field2
      suppress_alerts: True
      search: '| tstats summariesonly=true values("Authentication.tag") as "tag",dc("Authentication.user") as "user_count",dc("Authentication.dest") as "dest_count",count from datamodel="Authentication"."Authentication" where nodename="Authentication.Failed_Authentication" by "Authentication.app","Authentication.src" | rename "Authentication.app" as "app","Authentication.src" as "src" | where "count">=6'
