---
- debug:
    msg:
      START Merged correlation_searches state for integration tests on connection={{
      ansible_connection }}

- include_tasks: _remove_config.yaml

- block:
    - name: Merge and create new correlation searches configuration
      tags: merged
      register: result
      splunk.es.splunk_correlation_searches: &id001
        state: merged
        config:
          - name: Ansible Test
            disabled: false
            description: test description
            app: DA-ESS-EndpointProtection
            annotations:
              cis20:
                - test1
              mitre_attack:
                - test2
              kill_chain_phases:
                - test3
              nist:
                - test4
              custom:
                - framework: test_framework
                  custom_annotations:
                    - test5
            ui_dispatch_context: SplunkEnterpriseSecuritySuite
            time_earliest: -24h
            time_latest: now
            cron_schedule: "*/5 * * * *"
            scheduling: realtime
            schedule_window: 0
            schedule_priority: default
            trigger_alert: once
            trigger_alert_when: number of events
            trigger_alert_when_condition: greater than
            trigger_alert_when_value: 10
            throttle_window_duration: 5s
            throttle_fields_to_group_by:
              - test_field1
            suppress_alerts: false
            search: '| tstats summariesonly=true values("Authentication.tag") as "tag",dc("Authentication.user") as "user_count",dc("Authentication.dest") as "dest_count",count from datamodel="Authentication"."Authentication" where nodename="Authentication.Failed_Authentication" by "Authentication.app","Authentication.src" | rename "Authentication.app" as "app","Authentication.src" as "src" | where "count">=6'

    - name: Assert that task reports change and after dict is correctly generated
      assert:
        that:
          - result['changed'] == true
          - merged['after'] == result['correlation_searches']['after']

    - name: Assert that before dicts are correctly generated
      assert:
        that:
          - merged['before'] == result['correlation_searches']['before']

    - name: Merge provided configuration with device configuration (IDEMPOTENT)
      register: result
      splunk.es.splunk_correlation_searches: *id001

    - name: Assert that the previous task was idempotent
      assert:
        that:
          - result['changed'] == false

  always:
    - include_tasks: _remove_config.yaml
