---
- name: create test correlation search
  splunk.es.splunk_correlation_searches:
    config:
      - name: Ansible Test
        description: test description
        search: '| tstats summariesonly=true values("Authentication.tag") as "tag",dc("Authentication.user") as "user_count",dc("Authentication.dest") as "dest_count",count from datamodel="Authentication"."Authentication" where nodename="Authentication.Failed_Authentication" by "Authentication.app","Authentication.src" | rename "Authentication.app" as "app","Authentication.src" as "src" | where "count">=6'
    state: merged

- name: populate notable event adaptive response for test correlation search
  splunk.es.splunk_adaptive_response_notable_events:
    config:
      - correlation_search_name: Ansible Test
        description: test notable event
        drilldown_earliest_offset: $info_min_time$
        drilldown_latest_offset: $info_max_time$
        drilldown_name: test_drill_name
        drilldown_search: test_drill
        extract_artifacts:
          asset:
            - src
            - dest
            - dvc
            - orig_host
          identity:
            - src_user
            - user
            - src_user_id
            - src_user_role
            - user_id
            - user_role
            - vendor_account
        investigation_profiles:
          - test profile 1
          - test profile 2
          - test profile 3
        next_steps:
          - makestreams
          - nbtstat
          - nslookup
        name: ansible_test_notable
        recommended_actions:
          - email
          - logevent
          - makestreams
          - nbtstat
        security_domain: threat
        severity: high
    state: merged
