---
- name: create correlation search
  uri:
    url: "https://{{ ansible_host | default(inventory_hostname) }}:8089/servicesNS/nobody/SplunkEnterpriseSecuritySuite/saved/searches"
    user: ansible
    password: Ansible@123
    force_basic_auth: true
    status_code: 201
    method: POST
    body: 
      - [name, Ansible Test]
      - [search, '| tstats summariesonly=true values("Authentication.tag") as "tag",dc("Authentication.user") as "user_count",dc("Authentication.dest") as "dest_count",count from datamodel="Authentication"."Authentication" where nodename="Authentication.Failed_Authentication" by "Authentication.app","Authentication.src" | rename "Authentication.app" as "app","Authentication.src" as "src" | where "count">=6']
      - [ansible.correlationsearch.enabled, '1']
    body_format: form-urlencoded
    validate_certs: false
  register: ret_val
  ignore_errors: true

- debug:
    var: ret_val

- name: merge adaptive response notable events config
  splunk.es.adaptive_response_notable_events:
    config:
      - correlation_search_name: Ansible Test
        description: test notable event
        drilldown_earliest_offset: $info_min_time$
        drilldown_latest_offset: $info_max_time$
        drilldown_name: test_drill_name
        drilldown_search: test_drill
        extract_artifacts:
          asset: 
            - src
            - dest
            - dvc
            - orig_host
          identity: 
            - src_user
            - user
            - src_user_id
            - src_user_role
            - user_id
            - user_role
            - vendor_account
        investigation_profiles:
          - test profile 1
          - test profile 2
          - test profile 3
        next_steps:
          - makestreams
          - nbtstat
          - nslookup
        name: ansible_test_notable
        recommended_actions: 
          - email
          - logevent
          - makestreams
          - nbtstat
        security_domain: threat
        severity: high
    state: merged